In [ ]:
import pandas as pd
import numpy as np

#lendo a base de dados
df_vendas = pd.read_excel(r"Bases de Dados/Vendas.xlsx")
display(df_vendas)

,Código Venda,Data,ID Loja,Produto,Quantidade,Valor Unitário,Valor Final
0,1,2019-01-01,1,Sapato Estampa,1,358,358
1,1,2019-01-01,1,Camiseta,2,180,360
2,1,2019-01-01,1,Sapato Xadrez,1,368,368
3,2,2019-01-02,3,Relógio,3,200,600
4,2,2019-01-02,3,Chinelo Liso,1,71,71
...,...,...,...,...,...,...,...
100994,69996,2019-12-26,17,Short Listrado,2,102,204
100995,69996,2019-12-26,17,Mochila,4,270,1080
100996,69996,2019-12-26,17,Pulseira Estampa,1,87,87
100997,69997,2019-12-26,11,Camisa Listrado,1,108,108
100998,69997,2019-12-26,11,Short Linho,2,133,266

In [29]:
#verificando a base de dados
df_vendas.info()

<class 'pandas.DataFrame'>
RangeIndex: 100999 entries, 0 to 100998
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Código Venda    100999 non-null  int64
 1   Data            100999 non-null  datetime64[us]
 2   ID Loja         100999 non-null  int64
 3   Produto         100999 non-null  str
 4   Quantidade      100999 non-null  int64
 5   Valor Unitário  100999 non-null  int64
 6   Valor Final     100999 non-null  int64
dtypes: datetime64[us](1), int64(5), str(1)
memory usage: 5.4 MB

In [30]:
#separando o faturamento por loja diario/anaul
faturamento_dia = (
    df_vendas.groupby(["ID Loja", "Data"], as_index=False)["Valor Final"]
    .sum()
    .rename(columns={"Valor Final":"Faturamento Diario"})
    )

df_vendas["Ano"] = df_vendas["Data"].dt.year

faturamento_ano = (
    df_vendas.groupby(["ID Loja", "Ano"], as_index=False)["Valor Final"]
    .sum()
    .rename(columns={"Valor Final":"Faturamento Anual"})
    )

display(faturamento_dia)
display(faturamento_ano.head())

      ID Loja       Data  Faturamento Diario
0           1 2019-01-01                1086
1           1 2019-01-02                8015
2           1 2019-01-03                5735
3           1 2019-01-04                9129
4           1 2019-01-05                5213
...       ...        ...                 ...
8938       25 2019-12-21                3737
8939       25 2019-12-22                9027
8940       25 2019-12-23                4355
8941       25 2019-12-24                1960
8942       25 2019-12-25                4134

[8943 rows x 3 columns]

   ID Loja   Ano  Faturamento Anual
0        1  2019            1699681
1        2  2019            1590441
2        3  2019            1711968
3        4  2019            1674824
4        5  2019            1663770

In [31]:
#separando a variedade de itens vendidos por loja diaria/anual
variedade_itens_dia = (
    df_vendas.groupby(["ID Loja", "Data"], as_index=False)["Produto"]
    .nunique()
    .rename(columns={"Produto":"Variedade Diaria"})
)

variedade_itens_ano = (
    df_vendas.groupby(["ID Loja", "Ano"], as_index=False)["Produto"]
    .nunique()
    .rename(columns={"Produto":"Variedade Anual"})
)

display(variedade_itens_dia)
display(variedade_itens_ano.head())

      ID Loja       Data  Variedade Diaria
0           1 2019-01-01                 3
1           1 2019-01-02                14
2           1 2019-01-03                12
3           1 2019-01-04                18
4           1 2019-01-05                 6
...       ...        ...               ...
8938       25 2019-12-21                 9
8939       25 2019-12-22                19
8940       25 2019-12-23                 6
8941       25 2019-12-24                 6
8942       25 2019-12-25                13

[8943 rows x 3 columns]

   ID Loja   Ano  Variedade Anual
0        1  2019              120
1        2  2019              120
2        3  2019              120
3        4  2019              120
4        5  2019              120

In [32]:
#separando o ticket-medio de cada loja dia/ano
ticket_medio_dia = (
    df_vendas.groupby(["ID Loja", "Data"], as_index=False)[["Quantidade", "Valor Final"]]
    .sum()
    .assign(
        Ticket_Medio_Dia=lambda x: (
            x["Valor Final"] / x["Quantidade"].replace(0, pd.NA)
        ).round(2)
    )
    .drop(columns=["Valor Final", "Quantidade"])
    .rename(columns=lambda x: x.replace("_", " "))
)   

ticket_medio_ano = (    
    df_vendas.groupby(["ID Loja", "Ano"], as_index=False)[["Quantidade", "Valor Final"]]
    .sum()
    .assign(
        Ticket_Medio_Ano=lambda x: (
            x["Valor Final"] / x["Quantidade"].replace(0, pd.NA)
        ).round(2)
    )
    .drop(columns=["Valor Final", "Quantidade"])
    .rename(columns=lambda x: x.replace("_", " "))
)

display(ticket_medio_dia)
display(ticket_medio_ano.head())

      ID Loja       Data  Ticket Medio Dia
0           1 2019-01-01            271.50
1           1 2019-01-02            242.88
2           1 2019-01-03            204.82
3           1 2019-01-04            202.87
4           1 2019-01-05            372.36
...       ...        ...               ...
8938       25 2019-12-21            155.71
8939       25 2019-12-22            265.50
8940       25 2019-12-23            290.33
8941       25 2019-12-24            163.33
8942       25 2019-12-25            159.00

[8943 rows x 3 columns]

   ID Loja   Ano  Ticket Medio Ano
0        1  2019            198.10
1        2  2019            193.81
2        3  2019            189.92
3        4  2019            194.09
4        5  2019            190.58

In [33]:
#verificando se as metas foram batidas
fat_meta_dia = 1000
fat_meta_ano = 1650000
var_meta_dia = 4
var_meta_ano = 120
ticket_meta = 500 

def verificar_meta(df, valor, meta):
    df = df.copy()
    df["Bateu Meta"] = np.where(df[valor] >= meta, "Sim", "Não")
    return df

lista_dfs = [
    (faturamento_dia, "Faturamento Diario", fat_meta_dia),
    (faturamento_ano, "Faturamento Anual", fat_meta_ano),
    (variedade_itens_dia, "Variedade Diaria", var_meta_dia),
    (variedade_itens_ano, "Variedade Anual", var_meta_ano),
    (ticket_medio_dia, "Ticket Medio Dia", ticket_meta),
    (ticket_medio_ano, "Ticket Medio Ano", ticket_meta)
]

dfs_novos = [
    verificar_meta(df, valor, meta)
    for df, valor, meta in lista_dfs
]

(
    faturamento_dia,
    faturamento_ano,
    variedade_itens_dia,
    variedade_itens_ano,
    ticket_medio_dia,
    ticket_medio_ano
) = dfs_novos

display(faturamento_dia)

      ID Loja       Data  Faturamento Diario Bateu Meta
0           1 2019-01-01                1086        Sim
1           1 2019-01-02                8015        Sim
2           1 2019-01-03                5735        Sim
3           1 2019-01-04                9129        Sim
4           1 2019-01-05                5213        Sim
...       ...        ...                 ...        ...
8938       25 2019-12-21                3737        Sim
8939       25 2019-12-22                9027        Sim
8940       25 2019-12-23                4355        Sim
8941       25 2019-12-24                1960        Sim
8942       25 2019-12-25                4134        Sim

[8943 rows x 4 columns]

In [64]:
#criar as onepages
df_emails = pd.read_csv(r"Bases de Dados/Emails.csv")
df_lojas = pd.read_csv(r"Bases de Dados/Lojas.csv", sep=";")

df_emails_lojas = df_emails.merge(
    df_lojas,
    on="Loja",
    how="left"
)

df_emails_lojas["ID Loja"] = df_emails_lojas["ID Loja"].astype("Int64")


#filtrando os dfs pelo dia e ano

total_lojas = df_vendas["ID Loja"].nunique()

data_mais_recente = (
    df_vendas
    .groupby("Data")["ID Loja"]
    .nunique()
    .loc[lambda x: x == total_lojas]
    .index
    .max()
)

ano_atual = data_mais_recente.year

def filtrar_data_dfs(df, coluna, data):
    return df[df[coluna] == data]

lista_dfs_dia = (
    faturamento_dia,
    variedade_itens_dia,
    ticket_medio_dia,
)

dfs_filtrados_dia = [
    filtrar_data_dfs(df, "Data", data_mais_recente).set_index("ID Loja")
    for df in lista_dfs_dia
]

(
    faturamento_dia_fil,
    variedade_dia_fil,
    ticket_dia_fil,
) = dfs_filtrados_dia


lista_dfs_ano = (
    faturamento_ano,
    variedade_itens_ano,
    ticket_medio_ano
)

dfs_filtrados_ano = [
    filtrar_data_dfs(df, "Ano", ano_atual).set_index("ID Loja")
    for df in lista_dfs_ano
]

(
    faturamento_ano_fil,
    variedade_ano_fil,
    ticket_ano_fil,
) = dfs_filtrados_ano


def loc_onepage(df, id_loja, coluna):
    if id_loja in df.index:
        return df.at[id_loja, coluna]

    
for id_loja in df_emails_lojas["ID Loja"].dropna().unique():
    onepage_dia = pd.DataFrame({
        "Indicador": [
            "Faturamento",
            "Variedade",
            "Ticket Medio"
        ],
        "Valor Dia": [
            loc_onepage(
                faturamento_dia_fil,
                id_loja,
                "Faturamento Diario",
            ),
            loc_onepage(
                variedade_dia_fil,
                id_loja,
                "Variedade Diaria",
            ),
            loc_onepage(
                ticket_dia_fil,
                id_loja,
                "Ticket Medio Dia",
            )
        ],
        "Meta Dia": [
            fat_meta_dia,
            var_meta_dia,
            ticket_meta
        ],
        "Cenário Dia": [
            loc_onepage(
                faturamento_dia_fil,
                id_loja,
                "Bateu Meta",
            ),
            loc_onepage(
                variedade_dia_fil,
                id_loja,
                "Bateu Meta",
            ),
            loc_onepage(
                ticket_dia_fil,
                id_loja,
                "Bateu Meta",
            )
        ]       
    }).set_index("Indicador")

    onepage_ano = pd.DataFrame({
        "Indicador": [
            "Faturamento",
            "Variedade",
            "Ticket Medio"
        ],
        "Valor Ano": [
            loc_onepage(
                faturamento_ano_fil,
                id_loja,
                "Faturamento Anual",
            ),
            loc_onepage(
                variedade_ano_fil,
                id_loja,
                "Variedade Anual",
            ),
            loc_onepage(
                ticket_ano_fil,
                id_loja,
                "Ticket Medio Ano",
            )
        ],
        "Meta Ano": [
            fat_meta_ano,
            var_meta_ano,
            ticket_meta
        ],
        "Cenário Ano": [
            loc_onepage(
                faturamento_ano_fil,
                id_loja,
                "Bateu Meta",
            ),
            loc_onepage(
                variedade_ano_fil,
                id_loja,
                "Bateu Meta",
            ),
            loc_onepage(
                ticket_ano_fil,
                id_loja,
                "Bateu Meta",
            )
        ]       
    }).set_index("Indicador") 
    display(onepage_dia) 
    display(onepage_ano)

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     8521.00      1000         Sim
Variedade         11.00         4         Sim
Ticket Medio     284.03       500         Não

              Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1699681.0   1650000         Sim
Variedade         120.0       120         Sim
Ticket Medio      198.1       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     3983.00      1000         Sim
Variedade          8.00         4         Sim
Ticket Medio     173.17       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1590441.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      193.81       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     5306.00      1000         Sim
Variedade         11.00         4         Sim
Ticket Medio     212.24       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1711968.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      189.92       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     4082.00      1000         Sim
Variedade         12.00         4         Sim
Ticket Medio     151.19       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1674824.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      194.09       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      4704.0      1000         Sim
Variedade          10.0         4         Sim
Ticket Medio      235.2       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1663770.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      190.58       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     3180.00      1000         Sim
Variedade         13.00         4         Sim
Ticket Medio     167.37       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1640486.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      189.11       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     6380.00      1000         Sim
Variedade         18.00         4         Sim
Ticket Medio     177.22       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1722766.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      194.38       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     3242.00      1000         Sim
Variedade          6.00         4         Sim
Ticket Medio     147.36       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1646739.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      189.32       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     2195.00      1000         Sim
Variedade          8.00         4         Sim
Ticket Medio     121.94       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1698430.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      190.04       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     5618.00      1000         Sim
Variedade         20.00         4         Sim
Ticket Medio     133.76       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1682870.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      188.28       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      3190.0      1000         Sim
Variedade          11.0         4         Sim
Ticket Medio      151.9       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1707122.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      193.44       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     1562.00      1000         Sim
Variedade          8.00         4         Sim
Ticket Medio     111.57       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1586444.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      186.46       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     7655.00      1000         Sim
Variedade         10.00         4         Sim
Ticket Medio     263.97       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1631630.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      194.52       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      4136.0      1000         Sim
Variedade          10.0         4         Sim
Ticket Medio      188.0       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1726110.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      194.75       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     5719.00      1000         Sim
Variedade         12.00         4         Sim
Ticket Medio     238.29       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1721120.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      189.32       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     4899.00      1000         Sim
Variedade          4.00         4         Sim
Ticket Medio     376.85       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1649014.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      191.35       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     2879.00      1000         Sim
Variedade          6.00         4         Sim
Ticket Medio     221.46       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1668921.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      193.45       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     4994.00      1000         Sim
Variedade         15.00         4         Sim
Ticket Medio     192.08       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1624879.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      189.36       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      916.00      1000         Não
Variedade          4.00         4         Sim
Ticket Medio     101.78       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1731167.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      187.68       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     8171.00      1000         Sim
Variedade         17.00         4         Sim
Ticket Medio     204.28       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1721763.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      192.87       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     7698.00      1000         Sim
Variedade         17.00         4         Sim
Ticket Medio     183.29       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1648111.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      189.03       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      1830.0      1000         Sim
Variedade           6.0         4         Sim
Ticket Medio      152.5       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1635060.00   1650000         Não
Variedade         120.00       120         Sim
Ticket Medio      187.44       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     2510.00      1000         Sim
Variedade          9.00         4         Sim
Ticket Medio     147.65       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1678225.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      191.78       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento     6757.00      1000         Sim
Variedade         14.00         4         Sim
Ticket Medio     193.06       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1762419.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      197.25       500         Não

              Valor Dia  Meta Dia Cenário Dia
Indicador
Faturamento      4134.0      1000         Sim
Variedade          13.0         4         Sim
Ticket Medio      159.0       500         Não

               Valor Ano  Meta Ano Cenário Ano
Indicador
Faturamento   1653103.00   1650000         Sim
Variedade         120.00       120         Sim
Ticket Medio      191.38       500         Não

In [61]:
display(ticket_ano_fil)

          Ano  Ticket Medio Ano Bateu Meta
ID Loja
1        2019            198.10        Não
2        2019            193.81        Não
3        2019            189.92        Não
4        2019            194.09        Não
5        2019            190.58        Não
6        2019            189.11        Não
7        2019            194.38        Não
8        2019            189.32        Não
9        2019            190.04        Não
10       2019            188.28        Não
11       2019            193.44        Não
12       2019            186.46        Não
13       2019            194.52        Não
14       2019            194.75        Não
15       2019            189.32        Não
16       2019            191.35        Não
17       2019            193.45        Não
18       2019            189.36        Não
19       2019            187.68        Não
20       2019            192.87        Não
21       2019            189.03        Não
22       2019            187.44        Não
23       2019            191.78        Não
24       2019            197.25        Não
25       2019            191.38        Não

8521